# YOLOv26-n with BiVisionMamba on P3 (small object path)
nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12
  - [-1, 2, C3k2, [512, True]]                   # 13
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 2, C3k2, [256, True]]                   # 16 (P3 raw)
  - [-1, 1, BiVisionMamba, [256]]                # 17 ← Mamba on P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 18 (downsample)
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 2, C3k2, [512, True]]                   # 20 (P4 medium)
  - [-1, 1, Conv, [512, 3, 2]]                   # 21
  - [[-1, 10], 1, Concat, [1]]                   # 22
  - [-1, 1, C3k2, [1024, True, 0.5, True]]       # 23 (P5 large)
  - [[17, 20, 23], 1, Detect, [nc]]              # 24 Detect(P3_mamba, P4, P5)